vjtagaltera/nrf52840-dongle-vspim-nrfx-base/main.c
/**
 * Copyright (c) 2017 - 2020, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
#include "nrfx_spim.h"
#include "app_util_platform.h"
#include "nrf_gpio.h"
#include "nrf_delay.h"
#include "boards.h"
#include "app_error.h"
#include <string.h>
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#if 0
#define NRFX_SPIM_SCK_PIN  3
#define NRFX_SPIM_MOSI_PIN 4
#define NRFX_SPIM_MISO_PIN 28
#define NRFX_SPIM_SS_PIN   29
#define NRFX_SPIM_DCX_PIN  30
#elif 0 /* ok with instance 3 spim_extended mode */
  /* pin 9 10 not working, thus move to 13 31 */
#define NRFX_SPIM_SCK_PIN  13 //10  //pin 10 not working. 13 ok.
#define NRFX_SPIM_MOSI_PIN 31 //9   //pin 9 not working
#define NRFX_SPIM_MISO_PIN 32       //pin 32 input ok.
#define NRFX_SPIM_SS_PIN   20       //pin 20 output ce ok.
#define NRFX_SPIM_DCX_PIN  10 //13  //pin 10 not working. 13 ok.
#elif 1 /* ok with instance 0 */
  /* ok */
#define NRFX_SPIM_SCK_PIN  13 //10  //pin 10 not working. 13 ok.
#define NRFX_SPIM_MOSI_PIN 31 //9   //pin 9 not working
#define NRFX_SPIM_MISO_PIN 32       //pin 32 input ok.
#define NRFX_SPIM_SS_PIN   20       //pin 20 output ce ok.
//#define NRFX_SPIM_DCX_PIN  10 //13  //pin 10 not working. 13 ok.
#else
  /* xfer not going */
#define NRFX_SPIM_SCK_PIN  10//13 //10  //pin 10 not working. 13 ok.
#define NRFX_SPIM_MOSI_PIN 9 //31 //9   //pin 9 not working
#define NRFX_SPIM_MISO_PIN 32       //pin 32 input ok.
#define NRFX_SPIM_SS_PIN   20       //pin 20 output ce ok.
//#define NRFX_SPIM_DCX_PIN  10 //13  //pin 10 not working. 13 ok.
#endif

#if 0
#define SPI_INSTANCE  3                                           /**< SPI instance index. */
#else
#define SPI_INSTANCE  0                                           /**< SPI instance index. */
#endif
static const nrfx_spim_t spi = NRFX_SPIM_INSTANCE(SPI_INSTANCE);  /**< SPI instance. */

static volatile bool spi_xfer_done;  /**< Flag used to indicate that SPI instance completed the transfer. */

#define TEST_STRING "Nordic123456789012345678901234567890"
static uint8_t       m_tx_buf[] = TEST_STRING;           /**< TX buffer. */
static uint8_t       m_rx_buf[sizeof(TEST_STRING) + 1];  /**< RX buffer. */
static const uint8_t m_length = sizeof(m_tx_buf);        /**< Transfer length. */

void spim_event_handler(nrfx_spim_evt_t const * p_event,
                       void *                  p_context)
{
    spi_xfer_done = true;
    NRF_LOG_INFO("Transfer completed.");
    if (m_rx_buf[0] != 0)
    {
        NRF_LOG_INFO(" Received:");
        NRF_LOG_HEXDUMP_INFO(m_rx_buf, strlen((const char *)m_rx_buf));
    }
}

int main(void)
{
    bsp_board_init(BSP_INIT_LEDS);

    APP_ERROR_CHECK(NRF_LOG_INIT(NULL));
    NRF_LOG_DEFAULT_BACKENDS_INIT();

    nrfx_spim_xfer_desc_t xfer_desc = NRFX_SPIM_XFER_TRX(m_tx_buf, m_length, m_rx_buf, m_length);

    nrfx_spim_config_t spi_config = NRFX_SPIM_DEFAULT_CONFIG;
    //spi_config.frequency      = NRF_SPIM_FREQ_1M;
    spi_config.frequency      = NRF_SPIM_FREQ_125K;
    spi_config.ss_pin         = NRFX_SPIM_SS_PIN;
    spi_config.miso_pin       = NRFX_SPIM_MISO_PIN;
    spi_config.mosi_pin       = NRFX_SPIM_MOSI_PIN;
    spi_config.sck_pin        = NRFX_SPIM_SCK_PIN;
    #if 0 /* spim3 extended NRFX_CHECK(NRFX_SPIM_EXTENDED_ENABLED) */
    spi_config.dcx_pin        = NRFX_SPIM_DCX_PIN;
    spi_config.use_hw_ss      = true;
    #endif
    spi_config.ss_active_high = false;
    APP_ERROR_CHECK(nrfx_spim_init(&spi, &spi_config, spim_event_handler, NULL));

    NRF_LOG_INFO("NRFX SPIM example started.");
    NRF_LOG_PROCESS();

    uint32_t loop_count = 0;
    while (1)
    {
        // Reset rx buffer and transfer done flag
        memset(m_rx_buf, 0, m_length);
        spi_xfer_done = false;

        #if 0 /* spim 3 extended */
        //APP_ERROR_CHECK(nrfx_spim_xfer_dcx(&spi, &xfer_desc, 0, 15));
        APP_ERROR_CHECK(nrfx_spim_xfer_dcx(&spi, &xfer_desc, 0, NRF_SPIM_DCX_CNT_ALL_CMD-1));
        //APP_ERROR_CHECK(nrfx_spim_xfer_dcx(&spi, &xfer_desc, 0, 2));
        #else /* spim 0 */
        APP_ERROR_CHECK(nrfx_spim_xfer(&spi, &xfer_desc, 0));
        #endif

        while (!spi_xfer_done)
        {
            __WFE();
        }

        NRF_LOG_INFO(" sample %u ", ++loop_count);
        NRF_LOG_FLUSH();

        //bsp_board_led_invert(BSP_BOARD_LED_0);
        bsp_board_led_invert(BSP_BOARD_LED_3);
        //nrf_delay_ms(200);
        nrf_delay_ms(2000);
    }
}
